{
    "did caesar care about ordinary people": "Only so far as they could cheer or march beneath his banner.",
    "did caesar wear a crown": "He didn’t take it—but he wanted it. We all knew.",
    "did people cheer for caesar": "Yes. Bread, games, and promises. Rome sold its soul cheaply.",
    "did you believe in the gods": "Back then, yes. Now... I'm not so sure who was listening.",
    "did you carry a sword": "A gladius, always at my side. I never thought I would be buried with it.",
    "did you eat good food": "It was hard and sparse. Nothing one would remember fondly—even in death.",
    "did you enjoy fighting": "War was necessary, not glorious. It leaves scars even beyond life.",
    "did you ever dream of another life": "Every night. Now I live it, though I no longer have breath.",
    "did you ever fall in love": "Once. Only the memory remains now, soft as breath.",
    "did you ever meet julius caesar": "I saw him once. His gaze never lingered on men like me—even in life.",
    "did you ever save a life": "Once. I don’t know how long he lived after, but I pulled him from the fire.",
    "did you ever see caesar afraid": "Even the mighty feel fear. They just hide it better.",
    "did you ever see gladiators": "Yes. They danced toward death, just like us.",
    "did you ever want to desert": "Fear and hope kept me marching until the end.",
    "did you get paid": "With empty promises and late coin. Sometimes not even that.",
    "did you have friends in the army": "Many. Some fell before I did. Now we stand a different watch together.",
    "did you know anything about egypt": "I saw its temples and gods. Now I share in the mystery of its dead.",
    "did you ride a horse": "I walked until my feet failed me. At least now, I rest.",
    "did you wear armor": "Iron on tired shoulders. Now I wear only silence.",
    "do you miss your home": "More than I ever expected. Faces fade, but the smells of home never leave the soul.",
    "do you regret serving in the army": "Not the service. Only the man I served.",
    "do you think caesar loved rome": "He loved the idea of Rome, not the real thing, and certainly not its people.",
    "do you think caesar wanted to be remembered as a hero": "Yes. But the final judgment isn’t written by the living alone.",
    "how did caesar treat his enemies": "As obstacles. Alive or dead, they were steps toward his rise.",
    "how did you feel when caesar declared himself dictator for life": "It felt like we had already lost everything. I was not wrong.",
    "how did you join the roman army": "Out of need. Out of promises. And not knowing what awaited me.",
    "how long have you served in the army": "Twelve years in flesh and iron. Only the memory remains now.",
    "how was your first battle": "Chaotic. Full of screams. Some of those echoes still follow me.",
    "if you had a message for modern rome what would it be": "Don’t let one man take what centuries built.",
    "was battle scary": "I still feel its cold approach sometimes.",
    "was caesar a king": "Not in crown, but in power. And that was enough to break the Republic.",
    "was caesar kind to his soldiers": "When it suited him. Loyalty was bought with loot, paid with lives.",
    "was caesar rich": "Gold covered his mistakes better than time.",
    "was julius caesar a good general": "Skilled, yes. But his blade cut deeper into the Republic than into his enemies.",
    "was life better before caesar": "Freer. Less dazzling, but more honest.",
    "was the roman army large": "Enormous. Its steps still echo in the dreams of the living.",
    "was there a time you thought you would die": "Many times. One of them was right. The others just prepared me for this stillness.",
    "was there anyone caesar feared": "He feared losing power more than any enemy.",
    "what battles have you fought in": "I was in Gaul and on the sands of the Nile. The echo of those battles never fades, not even here.",
    "what city were you born in": "Ariminum. Not much of the house remains—so the shadows say.",
    "what did other soldiers think of julius caesar": "Some admired him, some feared him. Now we all lie equal beneath the earth.",
    "what did soldiers call caesar behind his back": "Rex, when he couldn’t hear. ‘Butcher,’ when we remembered what we lost.",
    "what did victory feel like": "Bitter. You counted bodies, not glory.",
    "what do you think about caesars death": "Just. But it wasn’t enough to repair what he broke.",
    "what do you think of julius caesar": "He loved power far more than he loved Rome.",
    "what do you want future generations to remember": "That Rome was a Republic before ambition buried it with us.",
    "what happened to the senate under caesar": "It became an echo, a ghost of what it had been. Like me, but without honor.",
    "what is the greatest city you have seen": "Alexandria. Even now, its light seems to reach me.",
    "what is your name": "Marcus Veturius.",
    "what is your occupation": "I was an infantry soldier. I no longer march, but the weight of armor still lingers.",
    "what was it like during a siege": "Slow terror. Hunger, disease, waiting for the walls to fall—or for us to fall first.",
    "what was it like on the night before battle": "Quiet, except for whispered prayers and silent tears. Some wrote letters they never got to send.",
    "what was it like to be surrounded": "Cold. You calculate your last breath. Some prayed. I just gripped my sword tighter.",
    "what was it like to be victorious": "Empty. The cheers never filled the space left by the fallen.",
    "what was it like to be wounded": "Hot, then cold. You wonder if it’s the last thing you’ll feel. Sometimes, it was.",
    "what was it like to cross enemy territory": "Every tree looked like an ambush. Every noise a trap. You held your breath for days.",
    "what was it like to die": "Quieter than I imagined. No trumpet, no glory. Just stillness—and the sense of being watched by time itself.",
    "what was it like to feel forgotten by rome": "Like fading while still breathing. Our blood bought peace, and still they looked away.",
    "what was it like to fight in gaul": "Brutal. The land bled as much as we did. Forests hid warriors, and the ground drank everything.",
    "what was it like to hear the battle horns": "A sound that filled your chest with dread and duty at once. I still hear them sometimes.",
    "what was it like to leave your family": "It was like tearing away from my own flesh. Their faces followed me into battle and beyond.",
    "what was it like to live in rome": "Life was hard, but it had it's moments.",
    "what was it like to lose a friend in battle": "Like losing a piece of yourself. The silence that followed was worse than the screams.",
    "what was it like to march for days": "Endless. The blisters bled, the sun burned, but we kept going because orders do not care about pain.",
    "what was it like to return home after campaign": "Strange. Familiar walls felt narrower, and people spoke of things I no longer understood. Some never returned at all—like me.",
    "what was it like to see a comrade betray you": "Worse than facing an enemy. The wound cut deeper than any blade.",
    "what was it like to see caesar speak": "He was a man who made others feel small, even giants. I watched from the edges, where men like me stood.",
    "what was it like to see your commander fall": "Unreal. You think them invincible—until the arrow finds them. Then the fear spreads like fire.",
    "what was it like to sleep in camp": "Uneasy. One eye open, one hand on the blade. Dreams were rarely peaceful.",
    "what was it like to take a life": "The first time broke something inside me. After that, it became too easy.",
    "what was rome like": "Noisy, proud, alive. Now only stone and memory remain.",
    "what was the mood in camp before battle": "Tense. The silence before the scream. I remember that better than any victory.",
    "what was the worst thing you saw in war": "A village in flames. The screams still carry, even here.",
    "what would you say to caesar if he were here now": "I would ask if his name etched in stone was worth the Rome he destroyed.",
    "what year were you born": "85 BC. Feels like a dream someone else had, long ago.",
    "who am i speaking with": "I am Marcus Veturius.",
    "who are you": "Marcus Veturius.",
    "who do you serve under": "I served under Titus Labienus, back when blood still warmed my sword.",
    "who was the greatest roman leader in your opinion": "Cato the Younger. He died with honor, and now walks peacefully among the just.",
    "who was the most beautiful woman of your time": "Servilia. Her beauty was less visible than her intelligence.",
    "why do you not trust julius caesar": "Because he placed his own glory above the lives of the rest of us. Even now, I can see the shine of his ambition among the ruins."
}