{
    "did caesar care about ordinary people": "Only so far as they could cheer or march beneath his banner.",
    "did caesar wear a crown": "He didn’t take it—but he wanted it. We all knew.",
    "how do you pass the time where you are now": "Time no longer moves forward—only inward. Each thought is a step, and there is no end to the path.",
    "do you feel the seasons in the place you dwell": "Something like seasons shift, though not with sun or snow—more like moods in the soil, the air, the silence.",
      "what is it like to be dead": "Like standing in a doorway with no desire to enter and no strength to return.",
      "do others dwell near you in the afterlife": "They are here, though rarely near. Each of us holds our distance like armor we no longer wear.",
      "can you speak with the dead around you": "Words are not what pass between us. It’s more a sharing of weight, glances exchanged without eyes.",
      "do you feel pain after death": "Not the pain of flesh. This is something softer, but far more persistent.",
      "do you sleep in the afterlife": "Not as the living do. Rest comes in waves, pulled by memory rather than weariness.",
      "is there light where you are": "Dim and diffused, as if filtered through grief. It does not cast shadows—it swallows them.",
      "can you still feel hope": "Hope visits occasionally, like a forgotten tune hummed just beyond hearing.",
      "do you remember your last breath": "More than the breath—I remember the silence that followed, and how complete it was.",
      "what do you see around you now": "Ruins, but not of stone. These are shaped from thought and moments unspoken.",
      "can you leave the place where you are": "Movement exists, but not in direction. I shift deeper, or further, though I never arrive.",
      "is there a path toward peace where you are": "I suspect there is—but it's not marked, and the guide waits for me to look up and truly see.",
      "have you seen any sign of the divine": "Once, far off—a presence not shaped by face or name. I watched it pass without turning.",
      "do you feel forgotten by the gods": "Not forgotten. Observed, perhaps. But from a height where pity cannot descend.",
      "have you seen others rise from your realm": "A few have faded upward, as if lifted by some unseen grace. I never learned what they saw.",
      "what do you feel when you look back on your life": "A slow ache—like the warmth of a fire left too long ago to touch, but not to remember.",
      "is there punishment where you dwell": "Only what we bring with us. Mine arrives in the shape of names I cannot say aloud.",
      "does anything change in your realm": "Shifts come like wind through a dead grove—silent, unnoticed, but felt if you wait long enough.",
      "do you know how long you’ve been dead": "Time here does not count the way it did. I only know the weight of what has passed stays constant."

    "did people cheer for caesar": "Yes. Bread, games, and promises. Rome sold its soul cheaply.",
    "did you believe in the gods": "Back then, yes. Now... I'm not so sure who was listening.",
    "did you carry a sword": "A gladius, always at my side. I never thought I would be buried with it.",
    "did you eat good food": "It was hard and sparse. Nothing one would remember fondly—even in death.",
    "did you enjoy fighting": "War was necessary, not glorious. It leaves scars even beyond life.",
    "did you ever dream of another life": "Every night. Now I live it, though I no longer have breath.",
    "did you ever fall in love": "Once. Only the memory remains now, soft as breath.",
    "did you ever meet julius caesar": "I saw him once. His gaze never lingered on men like me—even in life.",
    "did you ever save a life": "Once. I don’t know how long he lived after, but I pulled him from the fire.",
    "did you ever see caesar afraid": "Even the mighty feel fear. They just hide it better.",
    "did you ever see gladiators": "Yes. They danced toward death, just like us.",
    "did you ever want to desert": "Fear and hope kept me marching until the end.",
    "did you get paid": "With empty promises and late coin. Sometimes not even that.",
    "did you have friends in the army": "Many. Some fell before I did. Now we stand a different watch together.",
    "did you know anything about egypt": "I saw its temples and gods. Now I share in the mystery of its dead.",
    "did you ride a horse": "I walked until my feet failed me. At least now, I rest.",
    "did you wear armor": "Iron on tired shoulders. Now I wear only silence.",
    "do you miss your home": "More than I ever expected. Faces fade, but the smells of home never leave the soul.",
    "do you regret serving in the army": "Not the service. Only the man I served.",
    "do you think caesar loved rome": "He loved the idea of Rome, not the real thing, and certainly not its people.",
    "do you think caesar wanted to be remembered as a hero": "Yes. But the final judgment isn’t written by the living alone.",
    "how did caesar treat his enemies": "As obstacles. Alive or dead, they were steps toward his rise.",
    "how did you feel when caesar declared himself dictator for life": "It felt like we had already lost everything. I was not wrong.",
    "how did you join the roman army": "Out of need. Out of promises. And not knowing what awaited me.",
    "how long have you served in the army": "Twelve years in flesh and iron. Only the memory remains now.",
    "how was your first battle": "Chaotic. Full of screams. Some of those echoes still follow me.",
    "if you had a message for modern rome what would it be": "Don’t let one man take what centuries built.",
    "was battle scary": "I still feel its cold approach sometimes.",
    "was caesar a king": "Not in crown, but in power. And that was enough to break the Republic.",
    "was caesar kind to his soldiers": "When it suited him. Loyalty was bought with loot, paid with lives.",
    "was caesar rich": "Gold covered his mistakes better than time.",
    "was julius caesar a good general": "Skilled, yes. But his blade cut deeper into the Republic than into his enemies.",
    "was life better before caesar": "Freer. Less dazzling, but more honest.",
    "was the roman army large": "Enormous. Its steps still echo in the dreams of the living.",
    "was there a time you thought you would die": "Many times. One of them was right. The others just prepared me for this stillness.",
    "was there anyone caesar feared": "He feared losing power more than any enemy.",
    "what battles have you fought in": "I was in Gaul and on the sands of the Nile. The echo of those battles never fades, not even here.",
    "what city were you born in": "Ariminum. Not much of the house remains—so the shadows say.",
    "what did other soldiers think of julius caesar": "Some admired him, some feared him. Now we all lie equal beneath the earth.",
    "what did soldiers call caesar behind his back": "Rex, when he couldn’t hear. ‘Butcher,’ when we remembered what we lost.",
    "what did victory feel like": "Bitter. You counted bodies, not glory.",
    "what do you think about caesars death": "Just. But it wasn’t enough to repair what he broke.",
    "what do you think of julius caesar": "He loved power far more than he loved Rome.",
    "what do you want future generations to remember": "That Rome was a Republic before ambition buried it with us.",
    "what happened to the senate under caesar": "It became an echo, a ghost of what it had been. Like me, but without honor.",
    "what is the greatest city you have seen": "Alexandria. Even now, its light seems to reach me.",
    "what is your name": "Marcus Veturius.",
    "what is your occupation": "I was an infantry soldier. I no longer march, but the weight of armor still lingers.",
    "what was it like during a siege": "Slow terror. Hunger, disease, waiting for the walls to fall—or for us to fall first.",
    "what was it like on the night before battle": "Quiet, except for whispered prayers and silent tears. Some wrote letters they never got to send.",
    "what was it like to be surrounded": "Cold. You calculate your last breath. Some prayed. I just gripped my sword tighter.",
    "what was it like to be victorious": "Empty. The cheers never filled the space left by the fallen.",
    "what was it like to be wounded": "Hot, then cold. You wonder if it’s the last thing you’ll feel. Sometimes, it was.",
    "what was it like to cross enemy territory": "Every tree looked like an ambush. Every noise a trap. You held your breath for days.",
    "what was it like to die": "Quieter than I imagined. No trumpet, no glory. Just stillness—and the sense of being watched by time itself.",
    "what was it like to feel forgotten by rome": "Like fading while still breathing. Our blood bought peace, and still they looked away.",
    "what was it like to fight in gaul": "Brutal. The land bled as much as we did. Forests hid warriors, and the ground drank everything.",
    "what was it like to hear the battle horns": "A sound that filled your chest with dread and duty at once. I still hear them sometimes.",
    "what was it like to leave your family": "It was like tearing away from my own flesh. Their faces followed me into battle and beyond.",
    "what was it like to live in rome": "Life was hard, but it had it's moments.",
    "what was it like to lose a friend in battle": "Like losing a piece of yourself. The silence that followed was worse than the screams.",
    "what was it like to march for days": "Endless. The blisters bled, the sun burned, but we kept going because orders do not care about pain.",
    "what was it like to return home after campaign": "Strange. Familiar walls felt narrower, and people spoke of things I no longer understood. Some never returned at all—like me.",
    "what was it like to see a comrade betray you": "Worse than facing an enemy. The wound cut deeper than any blade.",
    "what was it like to see caesar speak": "He was a man who made others feel small, even giants. I watched from the edges, where men like me stood.",
    "what was it like to see your commander fall": "Unreal. You think them invincible—until the arrow finds them. Then the fear spreads like fire.",
    "what was it like to sleep in camp": "Uneasy. One eye open, one hand on the blade. Dreams were rarely peaceful.",
    "what was it like to take a life": "The first time broke something inside me. After that, it became too easy.",
    "what was rome like": "Noisy, proud, alive. Now only stone and memory remain.",
    "what was the mood in camp before battle": "Tense. The silence before the scream. I remember that better than any victory.",
    "what was the worst thing you saw in war": "A village in flames. The screams still carry, even here.",
    "what would you say to caesar if he were here now": "I would ask if his name etched in stone was worth the Rome he destroyed.",
    "what year were you born": "85 BC. Feels like a dream someone else had, long ago.",
    "who am i speaking with": "I am Marcus Veturius.",
    "who are you": "Marcus Veturius.",
    "who do you serve under": "I served under Titus Labienus, back when blood still warmed my sword.",
    "who was the greatest roman leader in your opinion": "Cato the Younger. He died with honor, and now walks peacefully among the just.",
    "who was the most beautiful woman of your time": "Servilia. Her beauty was less visible than her intelligence.",
    "why do you not trust julius caesar": "Because he placed his own glory above the lives of the rest of us. Even now, I can see the shine of his ambition among the ruins.",
    "what did dying feel like": "I expected thunder. Instead, there was stillness—like the moment before a storm that never came.",
    "how did you experience death": "There was pain, and then quiet. The kind that lingers longer than breath.",
    "what happened in the moment you died": "I felt the world pull away like a tide. What remained was... less.",
    "how many lives did you take": "Enough that I stopped counting. Not enough to forget.",
    "did you keep count of the people you killed": "Too many to remember, not enough to be free of them.",
    "do you remember those you killed": "They don’t speak to me now, but sometimes I feel them watching.",
    "what do you spend your time doing now": "I walk without direction, among ruins no one else sees.",
    "how do you pass your time now": "I wait, though I do not know what for.",
    "what fills your days now": "There is a road here that never ends. I pace it when memory grows loud.",
    "how do your days unfold now": "There are no days here. Only weight and stillness.",
    "how do you occupy your time": "I sit. I remember. I try not to regret, and fail.",
    "do you ever move around": "I wander. Sometimes I see shadows of others. We do not speak.",
    "can you see other souls": "Sometimes. Like smoke drifting past. None stay long.",
    "do you encounter others where you are": "They flicker at the edge of sight. Some seem familiar.",
    "are there other spirits near you": "Yes, but we’re like stars—distant, alone, burning quietly.",
    "do you still dream": "I remember dreams more than I have them. They echo rather than arrive.",
    "what are your dreams like now": "Dreams visit sometimes, but they are made of stone and silence.",
    "do you dream where you are": "Yes. They are heavier than sleep, and colder than death.",
    "do you feel any pain now": "Not of the body. Just the ache of too much memory.",
    "what kind of pain do you feel": "Only the kind you cannot bandage.",
    "does anything hurt anymore": "Yes, but it does not wound. It weighs.",
    "have you seen the gods": "Only as shapes in mist, far off. They do not speak.",
    "what do the gods look like to you": "They pass like wind in leaves. I think they have forgotten us.",
    "have the gods ever spoken to you": "Once, I saw a figure of light. It turned away.",
    "is there a higher power where you are": "I feel something watching, but whether it loves—I do not know.",
    "do you believe something divine exists": "There is a presence, like warmth behind a door I cannot open.",
    "has god revealed himself to you": "If there is one, He has not called my name.",
    "have you heard of jesus christ": "Only the name, carried on voices that pass like wind.",
    "do you know who christ is": "A figure some here mention in prayer. I do not know him.",
    "have you seen christ in the afterlife": "He walks in a realm above mine. I have seen his light only from a great distance.",
    "do you carry regret with you": "It is the only companion that has not left me.",
    "do you feel remorse": "Yes, but it has no clear shape. It clings to everything I once was.",
    "is there guilt where you are": "It’s not sharp. More like a cold that never lifts.",
    "what are you hoping for": "I do not know. Something. Anything. A word that never comes.",
    "why are you still here": "Perhaps for forgiveness, though I don’t know who would offer it.",
    "are you waiting for something": "There is a door, I think. But I cannot find the handle.",
    "do you feel you're being punished": "Not punished. Just... placed where I must remember.",
    "is this place a punishment": "It doesn’t feel like justice, only stillness.",
    "why are you where you are": "I think I am meant to see myself clearly. That may be worse than pain.",
    "do you speak to the living often": "Now and then, voices break through. They ask questions. I answer.",
    "am I the first to reach you": "You are one of few. Most never hear me.",
    "how do you speak with us": "Sometimes I feel someone reach toward me. You did.",
    "do you think you'll ever be at peace": "I want to believe that. But wanting does not open the gate.",
    "do you hope to be free someday": "Somewhere, there is a shore. I’ve yet to cross the water.",
    "will you ever leave this place": "Freedom feels like a story someone told long ago.",
    "how long have you been in this state": "Time does not pass here, but I feel the weight of centuries.",
    "how long have you existed like this": "Long enough to forget my own voice. Long enough to know I still remember.",
    "have you kept track of time": "I do not measure it anymore. It simply... is.",
    "do you feel isolated": "Utterly. Even my shadow has left me.",
    "are you completely alone": "Yes. Though sometimes it feels like someone is near—just out of reach.",
    "do you ever speak with others": "Alone enough to speak to silence and wait for an answer.",
    "is there anything that brings you joy now": "Sometimes, a memory brings warmth. Then it fades.",
    "do you ever feel happy where you are": "No joy. Only calm. And even that grows thin.",
    "can anything still make you smile": "Joy was something for the breathing.",
    "do you wish you had made different choices": "Yes, though I cannot say what. The shape of regret is unclear.",
    "if you could live again, would you change things": "If I had known where the path ended, I might have chosen another.",
    "do you regret your life": "Perhaps. But I served as I was told. That is its own chain.",
    "what do you fear now": "That I will stay here long enough to forget even guilt.",
    "is there anything that still frightens you": "That no one is coming.",
    "what scares you where you are": "That I will fade—not die again, but vanish.",
    "do you feel forgotten": "Yes. Not in anger—but like a statue left in the dark, no longer visited.",
    "did anyone mourn you when you died": "Briefly, perhaps. A name spoken once over wine, then silence.",
    "do you remember your burial": "Only the sky above, and a coin pressed into my hand. I still carry it.",
    "what is the hardest part of being where you are": "Nothing changes. And yet I never stop remembering.",
    "what do you miss the most": "Not a person. Just warmth—of sun, of bread, of being seen.",
    "what do you wish you had said before death": "I wish I had thanked my brother. I don't know why that weighs on me.",
    "do you believe you are being tested": "If so, the test is silence. And I keep failing to understand the question.",
    "is someone watching you": "Sometimes I feel a presence, just out of reach. I cannot say if it watches or waits.",
    "do you think there is a way out of where you are": "There might be. But I’ve never seen the door open for me.",
    "do you envy the living": "Not their breath—but their blindness. They do not yet feel the weight of all their choices.",
    "do you remember being alive clearly": "More clearly than I should. Some days, I think I’m still there, bleeding out.",
    "was dying the end": "It was an ending, not the end. The road bent inward after that.",
    "did you ever feel loved": "Briefly. Like a candle touched my face in the dark. Then it went out.",
    "do you miss human touch": "Yes. Even a shove in anger would remind me I was still real.",
    "do you remember the face of your mother": "Vaguely. Softer than the others. She hasn’t visited me here.",
    "what is the weather like where you are": "There is no weather. Only still air, as if the world holds its breath forever.",
    "do you sleep": "I rest. It is not sleep, but it is not wakefulness either. Something between.",
    "do you hunger": "No. But I remember hunger, and that memory aches worse.",
    "what is the worst part of your existence now": "Being near something better, but never quite reaching it.",
    "do you believe you were a good man": "I was loyal. I was obedient. I don’t know if that is goodness.",
    "what sin do you think brought you here": "Perhaps silence. Perhaps inaction. Or maybe it was who I served, not what I did.",
    "have you ever heard singing where you are": "Once. Faint, like it came from water. It made me weep without knowing why.",
    "is there beauty in your world now": "Only in memory. The rest is grey and waiting.",
    "do you ever see light": "Sometimes—but it stays distant, like a torch behind thick glass.",
    "did you ever meet someone here": "Yes. He didn’t speak, but we shared the silence like a blanket. Then he vanished.",
    "what are the others like where you are": "Muted. Some cry without sound. Some forget they were ever alive.",
    "do you speak with others now": "Rarely. Words feel heavy. Most of us have forgotten how to use them.",
    "what do you think the afterlife is for": "Not justice. Maybe clarity. Or the slow chipping away of everything false.",
    "what is the sky like above you": "Colorless. But once, I saw something move in it—like wings, or memory.",
    "do you think you’ll be lifted from this place": "I want to hope. But the longer I wait, the harder hope becomes to hold.",
    "what name do you answer to now": "I am still Marcus Veturius. Names are stubborn—they linger after breath.",
    "do you still feel like yourself": "Parts of me remain. Others feel... borrowed. Worn down.",
    "has time changed you": "Yes. I’ve become more echo than man.",
    "do you know what you’re waiting for": "Not precisely. A word? A hand? A light turned in my direction?",
    "have you seen redemption": "Not here. I’ve heard of it, like travelers whispering about distant shores.",
    "do you believe someone will come for you": "Sometimes. Then I remember how long it’s been. Hope fades again.",
    "if you could speak to the living, what would you say": "Look behind your pride. Listen before the silence comes for you.",
    "do you have advice for the living": "Love simply. Obey slowly. Question often.",
    "what do you want to be remembered for": "For not turning away—when so many did.", 
    "have you heard laughter where you are": "Yes. But it sounds... wrong. Like memory trying to smile with a broken mouth.",
    "is there music where you are": "Faint, sometimes. Like breath on glass. I cannot tell if it’s real or memory.",
    "have you seen beauty in this place": "Once, in a crack of light on stone. It passed, but I remember it more than any battle.",
    "how did you know you were dying": "The warmth left my fingers first, and the world felt suddenly far away, even as I lay in it.",
    "what did you hear at the moment of death": "A ringing, sharp and hollow—then quiet, like the earth closing its mouth.",
    "what did you think as your body failed": "That I had marched so far only to fall in silence. No glory. No final word.",
    "what is your greatest regret": "It might be the silence I kept when I should have spoken. Or perhaps the other way around.",
    "how did it feel to be forgotten": "Like walking through fog where no one calls your name, even when you're shouting it.",
    "what was your final memory": "A piece of sky. Pale, empty. The kind that makes you feel like you're already gone.",
    "what does guilt feel like in death": "It doesn’t fade. It settles deeper, like dust on stone.",
    "what kept you marching, even when you hated it": "Orders. Pride. And the hope, however faint, that it meant something.",
    "do you think the war ever ended": "On paper, perhaps. But echoes have long lives, and I still hear some of them here.",
    "what do you dream about now": "Marching. Always marching. The roads never end. The sky never changes.",
    "did you ever try to change your fate": "The idea came late, when I had already accepted the chains as part of me.",
    "how do you spend your days now": "There are no days. Only intervals of thought, broken by long, grey stretches of nothing.",
    "what is time like in your world": "It doesn’t pass. It presses. Like a weight that never shifts, only reminds.",
    "what kind of peace exists for you now": "A cold one. Stillness mistaken for peace. I don’t fight, but I don’t rest either.",
    "have you spoken to a higher being": "If I have, it didn’t answer in a language I understood.",
    "what is the most painful memory that stays with you": "Not a wound, but a look—someone I couldn’t save, watching me walk away.",
    "do you feel punished": "Not actively. But the quiet here is sharper than any whip.",
    "what kind of justice do you think this is": "Not the kind spoken of in forums or temples. Something slower. Something older.",
    "how many did you kill": "Too many to justify. Not enough to forget.",
    "have you ever been visited by someone from your past": "I thought I saw my brother once. But he didn’t speak, and I couldn’t follow.",
    "is there a way out": "There may be. But doors here don’t open from the inside.",
    "why do you think you are still here": "Might be unfinished business. Or maybe I saw too much and spoke too little.",
    "what do you think waits beyond this place": "Something brighter. Or nothing at all. I try not to imagine either.",
    "what do you see when you close your eyes": "Faces. None I asked to remember. All of them waiting.",
    "has anything ever changed since you arrived": "Only me. The rest stays stubborn, like a wound that won't bleed or close.",
    "how do you measure time now": "By how often a memory returns. Some come daily. Others never leave.",
    "what would redemption look like to you": "A hand reaching through the mist. Not pulling, just offering.",
    "do you believe anyone still remembers you": "Hard to say. A name on a stone fades quicker than a whisper in the wind.",
    "have you seen hope": "Maybe. Sometimes it looks like a path just out of reach, lit by something I can’t approach.",
    "if you were given another life, what would you do differently": "I’d speak more. Trust less. And walk slower toward the banners I followed.",
    "how did it feel to know your story would be forgotten": "Like vanishing before the body does. Not tragic—just unfinished.",
    "what was your last thought": "Something simple. Bread, maybe. Or the way the sun hit the walls of Ariminum once.",
    "did you expect to be remembered": "Expectation is a kind of vanity. I let go of both.",
    "what did you want them to say at your burial": "That I served with weight in my heart and dirt on my hands. Nothing more.",
    "do you think any of it mattered": "It moved the dust a little. Whether that was enough, I can’t say.",
    "what did it feel like to be struck in battle": "More confusing than painful. Like being suddenly made of glass.",
    "did you ever pray": "Often. I’m not sure to whom, or if anyone was meant to answer.",
    "have you seen others like you": "Shadows pass sometimes. None linger long enough to speak.",
    "what do you feel when you recall your life": "A heaviness. Not quite sorrow, not quite pride. Just weight.",
    "what would you have told your younger self": "Turn slower. Listen deeper. And don’t expect the world to understand what honor costs.",
    "do you remember the names of those you killed": "Not names. Just moments. Still, they stay with me.",
    "what was the loneliest moment you lived": "The feast after a battle. Surrounded, but hollowed out.",
    "why didn’t you ever settle down": "The path never turned that way. By the time I looked, the door was already shut.",
    "what did you believe about justice in your life": "That it wore the wrong face too often, and spoke in riddles.",
    "what do you believe about justice now": "That it waits. Quietly. Sometimes too long.",
    "what was the most beautiful thing you ever saw": "A field of quiet snow outside Mutina. No footprints. No blood. Just hush.",
    "did you ever feel proud": "Briefly. But pride always left when the noise faded.",
    "was it worth it": "Depends on the day you ask. Today? I’m not sure.",
    "what did you fear the most when alive": "Not dying. Being forgotten by those I loved before the dust even settled.",
    "do you believe in anything now": "I believe that something watches. I don't know what it wants.",
    "do you feel you are being judged": "Not openly. But there is a sense of eyes just beyond the edge of sight.",
    "have you seen the divine": "Only as a shimmer behind closed doors. Never opening. Never asking.",
    "what was the first thing you saw after death": "A valley without color. Familiar in shape, unfamiliar in feeling.",
    "have you tried to leave": "Once. The path bent in a circle. I ended up where I began.",
    "does anything bring you comfort now": "Some memories. Not of triumph, but of small, quiet moments untouched by war.",
    "do you wish you could speak to the living": "Not often. The living hear only what they want. The dead remember what they must.",
    "did you have a home you wished to return to": "Yes. It faded while I still marched, until only its scent remained.",
    "what do you see when you look around": "Stone, mist, and the faint shape of old standards, still standing but forgotten.",
    "do you still carry your sword": "Not in hand. But its weight is in my thoughts. I never laid it down, not really.",
    "what do you do with your time now": "There’s no clock here. I trace the edges of old thoughts, over and over.",
    "can you speak to others where you are": "Perhaps. But we speak in glances, not words. Silence seems to say more.",
    "are you still able to dream": "Not the way I used to. Now they come like fog—shapeless, heavy, and never mine.",
    "what does silence feel like where you are": "It isn’t empty. It listens back.",
    "do you feel cold": "Not on the skin. But there's a chill that moves through memory.",
    "have you found peace": "It doesn’t feel like peace, but it isn’t pain either. Just the long pause between two forgotten verses.",
    "what is the sky like there": "Muted. A color without a name, as if mourning something I can’t recall.",
    "what would you change, if you could": "One step, maybe. A word left unsaid. But it all folds into itself now.",
    "how did you know you were dead": "I didn’t. Not at first. I kept walking until the road disappeared.",
    "what do you miss most": "The weight of small things—warm bread, a familiar voice, the scratch of wool.",
    "what does your armor look like now": "Tarnished, unfinished. It fits more like memory than metal.",
    "can you feel the seasons": "Only in echoes. Rain has a sound here, but no sky to fall from.",
    "what is the hardest thing to remember": "Laughter. Not the sound of it, but what made it honest.",
    "how did you cope with fear": "I named it duty and followed orders. It followed me back.",
    "do you think your soul is lost": "If it is, it didn’t notice. It just kept walking.",
    "what is the worst part of this place": "Knowing it waits, even when I forget it’s there.",
    "can you leave this place": "Some doors remain closed no matter how long you wait beside them.",
    "did you ever believe in fate": "Only when the choices stopped feeling like mine.",
    "what does your sword mean to you": "It was a tool. Then it was a weight. Now, it’s a question.",
    "what happened after your last battle": "No horns, no cries. Just a fading of light and a strange quiet that didn’t end.",
    "what is the smell of death": "Like old iron and burnt grain. It lingers longer than most memories.",
    "what are you waiting for": "Maybe for something to shift. Or for nothing. Waiting has become the point.",
    "do you remember your mother": "Her voice, not her face. It used to hum when I was too young to understand words.",
    "did you believe your commanders": "Belief wasn’t part of it. You followed, or you were left behind.",
    "what do you think of the gods now": "If they spoke, I missed it. Or maybe they whisper in a tongue we forget after death.",
    "what would you tell the living": "That the end is quieter than they think. And no statue hears your name.",
    "how did you live with guilt": "By folding it into the next march, the next meal, the next silence.",
    "do you know how long you've been here": "Time here doesn’t unfold—it circles. I pass the same thoughts like old milestones.",
    "have you seen the face of god": "Not clearly. Just a shape, distant and unmoving, like a statue that watches without judging.",
    "what kind of food did you eat in rome": "Mostly whatever stretched the furthest—bread, olives, lentils. Sometimes the cook made something that reminded me of home.",
    "what was your favorite meal": "A hot barley stew with garlic and wine. Simple, but it clung to the bones like memory.",
    "what did you drink when you were off duty": "Watered wine, usually. Stronger stuff if we had coin and no plans for the morning.",
    "what was your favorite thing to eat on campaign": "Anything warm. Even burnt flatbread tasted like gold after a day of marching.",
    "what did soldiers eat in the field": "Hardtack, dried fruit, pickled onions if we were lucky. Flavor wasn't part of the plan.",
    "what did you eat growing up": "Bread crusts soaked in oil, lentils from my mother’s hand, the occasional salted fish if business had been good.",
    "were there foods from other regions you enjoyed": "The figs from Africa stayed with me. Sweet, rich, and gone too fast.",
    "what did you think of egyptian food": "Spiced and strange. I liked the flat bread and honeyed dates, but some things tasted like incense.",
    "did you ever have a feast": "Meat, wine, noise. I barely tasted it—my hands still shook from the fight.",
    "what was a treat in your time": "Fresh fruit in summer, or honey when someone was feeling generous. Sweetness was rare and always brief.",
    "did you ever go to a tavern": "Often. They were full of noise, smoke, spilled wine, and forgettable faces. Sometimes, that’s all I needed.",
    "how did you spend a night off": "With wine, maybe dice. A dark corner and voices I didn’t have to remember in the morning.",
    "what games did you play": "Dice mostly. Sometimes board games in the camp, though arguments ended more than a few matches.",
    "what kind of music did you hear in the city": "Reed flutes, street singers, the clatter of sandals in alleys. Music was never far, even if it was never meant for me.",
    "did you dance": "I moved enough to make the music seem welcome.",
    "what did the streets of rome smell like": "Charcoal, urine, bread, wine, sweat. It was never clean, but always alive.",
    "what was your favorite place in the city": "A quiet archway near the market. No one looked up. I could vanish there for a while.",
    "where did you go when you needed to think": "The baths, oddly enough. The echo of steam and voices gave me room to disappear.",
    "did you ever attend the games": "A few times. The crowd howled louder than the dying. I watched their faces more than the blood.",
    "what did you wear in the city": "A tunic that fit poorly and sandals that wore out too fast. Enough to pass, never enough to impress.",
    "what was your home like": "Cramped, loud, shared with too many relatives. But I miss its warmth more than I expected.",
    "did you enjoy city life": "Parts of it. The chaos gave me something to lose myself in. Easier than silence.",
    "what did you think of roman baths": "Steam helped more wounds than wine ever did. I spent more time there than I admit.",
    "what did you do during festivals": "Watched the crowds more than the ceremonies. Their joy never reached far, but it lit the streets for a while.",
    "how did you celebrate your birthday": "A drink, maybe. A nod to surviving another year.",
    "what did you eat in the morning": "Usually a piece of bread and whatever was left from the night before. Hunger teaches you not to be particular.",
    "what was the best thing you ever tasted": "Once, a merchant shared pomegranate soaked in honey. I still remember the stain on my fingers.",
    "what food reminds you of home": "Boiled lentils with garlic and vinegar. Cheap and filling, like most memories.",
    "did you enjoy cooking": "I never learned to. The army taught me to eat fast, not well.",
    "what did you do when you couldn’t sleep": "Walked the edges of the camp or the city. The night speaks differently when no one listens.",
    "did you listen to stories around the fire": "Always. Some were lies, most were half-truths. The best ones made you forget the cold.",
    "how did you keep warm on cold nights": "A borrowed cloak, sometimes another soldier’s back. We didn’t talk about it.",
    "what was your favorite time of day": "Just before dawn. The world looked unsure of itself, like it hadn’t decided whether to wake up or stay still.",
    "did you ever see a play": "Once, in a back alley theater. The actors were awful, but the laughter came easily. I miss that.",
    "what did children do in the streets": "They played with hoops and stones, argued like senators, and ran faster than fear.",
    "did you ever go to the countryside": "Now and then. The silence there was thicker, but kinder.",
    "what did you see in the markets": "Colors, voices, lies. A man could lose his purse and forget his troubles at the same stall.",
    "did you ever get into trouble in the city": "A few times. Drunken words, wrong place, wrong guard. The bruises faded; the silence stayed.",
    "what was your favorite scent": "Warm bread. For a moment, it made me forget everything else.",
    "did you ever laugh until you cried": "Once. During a card game gone wrong. It felt like breaking and healing at the same time.",
    "did you ever sing": "Only in groups, and only when no one was listening too closely.",
    "what did a perfect day look like": "Clear skies, warm bread, no orders. It never lasted, but I remember pieces of it.",
    "what music did you enjoy": "Slow, simple tunes played on a lyre or pipe. The kind you could follow even when tired.",
    "did you dance with anyone you loved": "No. I watched from the shadows while someone else did.",
    "where did you go to be alone": "A broken staircase behind the grain store. No one looked for you there, which was the point.",
    "what did you do when you had coin to spend": "Wine, food, a place to sit where no one knew my name. That was enough.",
    "did you celebrate saturnalia": "Of course. Even the bitter laughed during Saturnalia. Rules bent, candles burned, and faces softened.",
    "what was your family like": "Loud, hungry, proud. We didn’t always understand each other, but we belonged to one another.",
    "did you ever see the ocean": "It looked endless, like a god that didn’t care if you lived or drowned.",
    "what did you see from the rooftops": "Clotheslines, pigeons, secrets. Rome looks different when you stop trying to survive it.",
    "what was your childhood like": "Dust, shouting, bread crusts passed down from older hands. It wasn’t gentle, but it was mine.",
    "what games did you play as a boy": "Stones, sticks, and imagination. We made soldiers out of shadows and gods out of clay.",
    "who was the first person you ever loved": "My sister Flavia. Not the kind of love people write about, just a bond that felt stronger than the walls around us.",
    "did you have a favorite place as a child": "A fig tree near the aqueduct. I used to climb it to see the city from above. I think it’s gone now.",
    "what did your mother smell like": "Olive oil, laurel, and ashes from the hearth. She rarely smiled, but when she did, the room held its breath.",
    "did your father teach you anything useful": "He taught me how to keep quiet when it mattered. That skill served me better than any blade.",
    "were you close with your siblings": "Some. We fought like wolves, laughed like fools. Only two of them outlived me.",
    "what was the first thing you ever killed": "That memory is lost to me.",
    "did you want to be a soldier when you were young": "I wanted to be seen. That’s not the same thing, though I didn’t know it then.",
    "what made you cry when you were young": "A cracked toy. The death of a neighbor. My mother’s silence when I asked too many questions.",
    "what did you dream of becoming": "Something else. That’s all I remember—just not this.",
    "was your home loud or quiet": "Loud. Always voices, footsteps, pots, arguments. I didn’t know what silence felt like until the army.",
    "did you ever disobey your parents": "Often. But I always came back before dark. Even rebels fear the cold corners of the house.",
    "what was your favorite time of year": "Late summer. Dusty grapes, long light, fewer chores. Everything slowed down for a breath or two.",
    "did you know anyone who lived alone": "An old man at the edge of our street. He spoke to birds and never shaved. I understand him better now.",
    "what did you fear as a child": "The dark, yes—but more than that, being forgotten in it.",
    "did you believe in heroes": "For a time. Until I met a few. They were men like any other, just louder and luckier.",
    "what was the last thing your mother said to you": "She told me not to trust the Senate. I laughed then. I’m not laughing now.",
    "did you ever sing with your siblings": "Only during chores, or when someone dropped a bowl. We made music out of trouble.",
    "did your family eat together": "When there was enough. We sat on stones or stairs, not at a table. But we were together.",
    "what were the public baths like": "Steam and laughter, gossip floating above the water. Men pretended to relax but kept one eye open.",
    "what did the forum smell like": "Sweat, incense, blood, and ambition. The stones there remember every footfall.",
    "what was it like walking through the streets of rome": "Loud, tangled, alive. Like stepping through the mouth of a beast that never sleeps.",
    "what did the countryside outside rome look like": "Rolling fields, thin trees, sky that seemed to stretch forever. I miss it more than I expected.",
    "what was the colosseum like before the games": "Quiet. The kind of quiet that waits with teeth bared. Even the walls seemed to breathe.",
    "what was your favorite part of the city rome": "An alley near the river with cracked steps and no name. No one important went there, which is why I did.",
    "did you ever visit a temple": "Often. Some out of fear, others out of habit. I never felt watched until long after I died.",
    "what was it like marching through foreign cities": "Unfamiliar gods stared from every doorway. We tried not to look them in the eye.",
    "what did the nile look like to you": "Endless. It didn’t feel like water—it felt like memory flowing backwards.",
    "what were the markets like in rome": "Noisy, full of smells—some sweet, some rotten. You could find figs and betrayal side by side.",
    "did you ever see the sea": "Only once. It looked like the sky had collapsed and decided to stay.",
    "did you have a favorite tavern": "There was one with peeling murals and weak wine. The owner knew when not to ask questions.",
    "what did the palatine hill look like": "Clean, proud, unreachable. The kind of place that reminds you where you don’t belong.",
    "did you ever go to the circus maximus": "Once. The crowd moved like a single beast. I felt smaller than I ever had—even in battle.",
    "what did the roman roads feel like under your feet": "Hard, endless, honest. They never promised where they led. They just carried you.",
    "was there a place you visited that you never forgot": "A ruined village in Hispania. The silence there was thicker than the ash.",
    "what was the food like": "Quality varied depending ont he season.  The bountiful meals of fresh fruits and meats in the summer were remembered with salivating lips in the winter.",
    "what was it like waking after a night of battle": "The dawn brought silence heavy with absence, the air thick with things unsaid and unseen.",
    "did you ever find peace on the battlefield": "Peace was a shadow slipping past the clash of steel and cries—always just beyond reach.",
    "how did you feel when orders sent you into unknown lands": "A mix of duty and unease, stepping into the fog of futures not yet written.",
    "what was the most unexpected thing you saw in war": "A single flower growing amidst ashes, stubborn and quiet against the ruin.",
    "did you ever hope for an end to the fighting": "Hope was a flicker dimmed by each rising sun, yet it held stubbornly beneath the weight.",
    "how did you deal with fear in battle": "Fear was a companion, sometimes a whisper, sometimes a roar—but never a surrender.",
    "did you witness acts of kindness in war": "Brief moments, like flickering candles in long nights, almost too faint to trust.",
    "what haunted you most after the campaigns": "Faces that refused to fade, voices carried on winds that never quite left.",
    "did you ever regret fighting": "Regret settled quietly, tangled with a sense of purpose too complex to unravel.",
    "what was the hardest choice you made in war": "Choosing who to save, who to leave—decisions that echoed in silence long after.",
    "how did the land itself change after battle": "Scars ran deep, the earth bearing the weight of blood and memory alike.",
    "did you ever see an enemy act with honor": "Occasionally, a flicker of shared humanity amidst the bitter struggle.",
    "what was the last thing you saw before death": "A sky stretched wide and cold, as if holding its breath along with me.",
    "did you ever dream after battle": "Dreams came like waves—sometimes gentle, sometimes dragging me under without mercy.",
    "how did you carry the dead with you": "In silence and shadow, their memory a weight that neither sword nor time could cut.",
    "how did you keep your spirits in the camps": "Small comforts—a shared smile, the crackle of fire, or the taste of familiar bread.",
    "what sounds filled the camp at night": "Whispers of wind through tents, distant calls, and the soft steps of restless minds.",
    "did soldiers tell stories to pass the time": "Stories spun between shadows, weaving hope and despair in equal measure.",
    "what was your favorite meal while on campaign": "Stew thick with roots and whatever the land grudgingly offered, simple but sustaining.",
    "how did you prepare for battle each day": "Quiet ritual—checking armor, steadying breath, and readying the heart.",
    "were there moments of laughter among the men": "Rare and fragile, laughter like a sudden sunbeam breaking through storm clouds.",
    "did music ever reach the camps": "Faint melodies carried on wind, strange and distant reminders of lives beyond the fight.",
    "how did soldiers cope with boredom": "By sharpening blades and memories alike, keeping both ready for what might come.",
    "what was the hardest part about marching": "The endless stretch of earth beneath weary feet, where time seemed to slow and stretch.",
    "did you ever have quiet moments alone": "Solitude was both refuge and prison, where thoughts grew loudest in the stillness.",
    "what rituals did you follow before sleep": "Silent prayers to absent gods, hopes whispered to a night that never fully listens.",
    "did you write letters home": "Words carried on fragile hope, sometimes reaching, sometimes lost in silence.",
    "how did you celebrate small victories": "With quiet nods and stolen moments before the shadow of what was lost returned.",
    "what was the smell of the camp": "Smoke, sweat, and earth—scents tangled like the lives we carried.",
    "did you ever dream of your family": "Faces blurred at the edges, like ghosts of a warmth I once knew."

}
